[
  {
    "_id": 789,
    "topic": "React",
    "userName": "React Web Development",
    "time": "2h",
    "title": "React.js is a component based front end library that makes it very easy to build Single Page Applications or SPAs",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/React-icon.svg/2300px-React-icon.svg.png",
    "liked": true,
    "replies": 123,
    "retuits": 432,
    "likes": 2345,
    "handle": "@ReactJS",
    "tuit": "People expect web app pages to load fast. On the server, React lets you start streaming HTML while you’re still fetching data, progressively filling in the remaining content before any JavaScript code loads. On the client, React can use standard web APIs to keep your UI responsive even in the middle of rendering."
  },
  {
    "_id": 890,
    "topic": "JavaScript",
    "userName": "JavaScript Lover",
    "time": "4d",
    "title": "JavaScript is programming language that can run on browsers as well as desktops",
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6a/JavaScript-logo.png",
    "liked": false,
    "replies": 234,
    "retuits": 543,
    "likes": 3456,
    "handle": "@javaScript",
    "tuit": "JavaScript is a programming language that is one of the core technologies of the World Wide Web, alongside HTML and CSS. As of 2022, 98% of websites use JavaScript on the client side for webpage behavior, often incorporating third-party libraries. All major web browsers have a dedicated JavaScript engine to execute the code on users' devices. JavaScript is a high-level, often just-in-time compiled language that conforms to the ECMAScript standard.[10] It has dynamic typing, prototype-based object-orientation, and first-class functions. It is multi-paradigm, supporting event-driven, functional, and imperative programming styles. It has application programming interfaces (APIs) for working with text, dates, regular expressions, standard data structures, and the Document Object Model (DOM). "
  },
  { 
    "_id": 123, 
    "topic": "jQuery", 
    "userName": "Colin Robinson", 
    "title": "Wow I love jQuery so much",
    "time": "2h",  
    "image": "avatar-spacex.jpeg",
    "liked": true,
    "replies": 345,
    "retuits": 321,
    "likes": 1234,
    "handle": "@jquery_king",
    "tuit": "Do people still use jQuery? I thought the biggest advantage of this library back in the day was css selector access of DOM nodes (back when we only had getElementById, getElementsByClassName, and getElementsByTagName). This has been rolled into the Javascript document api via document.querySelector, and document.querySelectorAll. Also there are browser compatibility issues that jQuery solved but a lot of these are solved with smaller footprint libraries like lodash. Also for me, along with I'm sure many others, keeping state within the DOM has fallen out of favor of more comprehensible state management inside of JS (like React Hooks, Redux...etc.) What is the current use-case for jQuery? I'm curious from hearing it's current users answer this. "
  },
  {
    "_id": 234,
    "topic": "Web Development",
    "userName": "ReactJS",
    "time": "2h",
    "title": "React.js is a component based front end library that makes it very easy to build Single Page Applications or SPAs",
    "image": "reactjs-blue.png",
    "liked": false,
    "replies": 345,
    "retuits": 1122,
    "likes": 32,
    "handle": "@reactjs",
    "tuit": "React.js is a component based front end library that makes it very easy to build Single Page Applications or SPAs. React makes it painless to create interactive UIs. Design simple views for each state in your application, and React will efficiently update and render just the right components when your data changes."
  },
  {
    "_id": 345,
    "topic": "",
    "userName": "JavaScript",
    "time": "1 day",
    "title": "JavaScript is programming language that can run on browsers as well as desktops",
    "image": "javascript.png",
    "tweets": "123K",
    "liked": false,
    "replies": 32,
    "retuits": 156,
    "likes":6789,
    "handle": "@javascript",
    "tuit": "JavaScript is programming language that can run on browsers as well as desktops. JavaScript is a high-level, often just-in-time compiled language that conforms to the ECMAScript standard."
  },
  {
    "_id": 456,
    "topic": "Web Development",
    "userName": "jQuery",
    "title": "",
    "time": "last week",
    "image": "jquery.png",
    "tweets": "122K",
    "liked": false,
    "replies": 1111,
    "retuits": 2222,
    "likes": 33,
    "handle": "",
    "tuit": ""
  },
  {
    "_id": 567,
    "topic": "Web Development",
    "userName": "NodeJS",
    "title": "",
    "time": "last month",
    "image": "nodejs.png",
    "tweets": "120K",
    "liked": false,
    "replies": 3890,
    "retuits": 21,
    "likes": 45,
    "handle": "",
    "tuit": ""
  }
]
